import flower1 from '../images/тюльпан.jpg';
import flower2 from '../images/ромашка.jpg';
import flower3 from '../images/гиацинт.jpg';
import flower4 from '../images/пион.jpg';
import flower5 from '../images/гладиолус.jpg';
import flower6 from '../images/роза.jpg';


const FlowerInfo = 

    [
        {
            id: 1,
            tableClassName: "",
            tdClassName: "bl",
            h2name: "Тюльпан",
            imgSrc: flower1,
            imgClassName: "circle",
            ulInfo: <ul className="txt">	
            <li> Теневыносливые</li>
            <li>Семейство: лилейные </li>
            <li>Род тюльпанов насчитывает до 140 видов</li>
            <li>Луковичное растение </li>
            <li>Посадка: Они любят солнечные и защищенные от ветра и сквозняков места. Если среда не подойдет цветам, то питательные вещества в луковицах не будут образовываться в достаточном количестве и головки цветочков будут поникшими. Почва должна быть жирной и рыхлой, поэтому перед высадкой в открытый грунт ее нужно удобрить перегноем. Посадку растения проводят в начале октября, некоторые сорта сажают в конце сентября. Цвести начинает с конца апреля, и радует нас своими изящными цветами до начала июня.</li>
            <li>Листья у тюльпанов растут от основания надземной части до середины стебля. Нижние листья крупные, удлиненно-ланцетные или широко овальные, часто с волнистым краем, иногда серповидно изогнуты; верхние — значительно мельче. Количество листьев от 2 до 6. Окраска от ярко-зеленого до сизого тона. У некоторых дикорастущих видов и их садовых форм листья с верхней стороны имеют фиолетово-бурые пятна.</li>
            <li>Цветки состоят из шести свободных опадающих долей околоцветника и имеют яркую окраску самых разнообразных тонов. Форма цветка бывает простая колокольчатая, воронковидная, звездчатая.</li>
        </ul>  ,
    
        tableClassName2: "",
        tdClassName2: "pin",
        h2name2: "Пион",
        imgSrc2: flower4,
        imgClassName2: "circle",
        ulInfo2: <ul className="txt">
        <li>Теневыносливый </li>
        <li>Семейство: Пионовые </li>
        <li>Посадка : Эти растения очень светолюбивы, боятся сквозняков и холодных ветров. Поэтому сажать их надо на солнечном, хорошо защищенном от ветра месте. Посаженные в тени, пионы будут плохо расти и цвести. Некоторые сорта могут вообще не образовывать бутонов. Почвы пионам нужны очень плодородные, богатые органикой, рыхлые с нейтральной реакцией). Кислые – этим растениям вообще противопоказаны. Но месяц цветения один – июнь. Ранние сорта начинают покрываться бутонами в конце мая и продолжают цвести до 10 июня. Со средними сроками цветения – до 20 числа, поздние – заканчивают в последних числах июня.</li>
        <li>Цветки диаметром до 15—25 см, одиночные, с чашечкой и венчиком. </li>
        <li>Листья непарно перистораздельные или тройчатые, с широкими или узкими долями, тёмно-зелёные, реже сизые, осенью жёлтые, бурые, красноватые или тёмно-фиолетовые.</li>
    </ul> 
            
        },

        {
            id: 2,
            tableClassName: "tab2",
            tdClassName: "pin",
            h2name: "Ромашка",
            imgSrc: flower2,
            imgClassName: "circle",
            ulInfo: <ul className="txt">	
            <li> Светолюбивые </li>
            <li>Семейство: Астровые</li>
            <li>Посадка:В грунт рассаду высаживают в возрасте 4-6 недель, когда пройдут все возможные заморозки. Ромашка садовая любит солнечные участки с известковой или нейтральной почвой и глубоким залеганием грунтовых вод. Посадка: посев семян в грунт – в конце мая, посев семян на рассаду – в марте, высадка сеянцев в сад – в мае. Цветение: с начала июля по сентябрь. </li>
            <li>Соцветие — полусферические корзинки диаметром 4—20 мм объединены в щитковидное соцветие. В корзинках имеются цветки двух типов: на диске находятся жёлтые трубчатые обоеполые цветки, с краю — белые ложноязычковые пестичные </li>
    </ul>   ,
    
        tableClassName2: "",
        tdClassName2: "bl",
        h2name2: "Гиацинт",
        imgSrc2: flower3,
        imgClassName2: "circle",
        ulInfo2:  <ul className="txt">
        <li>Светолюбивые </li>
        <li>Семейство: Спаржевые </li>
        <li>Луковичное растение</li>
        <li>Посадка: Оптимально высаживать гиацинты в конце сентября — начале октября. Они предпочитают солнечные и безветренные участки. Не сажайте гиацинты рядом с деревьями и кустарниками, так как их корни заберут большинство питательных веществ. Пусть место будет ровное, можно с уклоном. Почву лучше подготовить заранее: глубоко перекопать, внести удобрения — минеральные и перегной . Гиацинт не терпит кислых, плотных почв и застоя воды. Лучшая почва для гиацинтов — легкая, рыхлая, нейтральная, хорошо дренированная. </li>
        <li>Цветки собраны на верхушке стебля в виде кисти. Околоцветник их, в виде колокольчатой воронки, ярко окрашен и с отогнутыми лопастями.</li>
    </ul>   
            
        },

        {
            id: 3,
            tableClassName: "tab2",
            tdClassName: "bl",
            h2name: "Гладиолус",
            imgSrc: flower5,
            imgClassName: "circle",
            ulInfo:<ul className="txt">
            <li> Светолюбивые </li>
            <li>Семейство: Ирисовые </li>
            <li>Луковичное растение</li>
            <li>Посадка:Наименьшие расстояния между крупными клубнелуковицами в ряду 15 см, между рядами — 20, для детки — соответственно, 5 и 15 см. Глубина посадки зависит от состава почвы и размера клубнелуковиц. Посадочный материал диаметром 4-5 см (тот, что дает цветоносы наилучшего качества) сажают на глубину 10-12 см. На песчаных и черноземных почвах глубину посадки можно увеличить до 15 см, на глинистых и заболоченных — уменьшить до 7-9 см. ранние, цветут в июле; средние, цветут в августе; поздние, цветут в сентябре. </li>
            <li> Цветки собраны в одностороннее, двустороннее или спиральное колосовидное соцветие до 80 см длиной, рыхлое, среднеплотное или плотное. Цветки сидячие с простым воронковидным околоцветником из шести неодинаковых долей, сросшихся основаниями, различной величины и формы.</li>
        </ul>   ,
    
        tableClassName2: "",
        tdClassName2: "pin",
        h2name2: "Роза",
        imgSrc2: flower6,
        imgClassName2: "rose",
        ulInfo2:  <ul className="txt">	
        <li> Тенелюбивые</li>
        <li>Семейство: Разноцветные </li>
        <li>Посадка: Розы можно высаживать в два срока: весной (начиная с мая) и осенью (с сентября и до морозов), важно завершить посадку за 2-3 недели до того, как наступят устойчивые отрицательные температуры. Температура почвы при любых сроках посадки должна быть выше 10-12 градусов.  Почву хорошо перекопать два раза. Питательный слой земли на участке для роз должен быть до 70 см. Ямы готовят размером 50х50х30см, при групповой посадке можно чуть меньше. Если высаживается группа розовых кустов, то среднерослые розы сажают через 50см, сильнорослые - через 70-100 см.</li>
        <li>Цветки: Растение в большинстве случаев представляет собой разветвленный кустарник, стебли которого покрыты шипами, роза имеет зеленые листья и большие ароматные цветы самого разного окраса. </li>
    </ul>  
            
        },
    ]

    export default FlowerInfo;